IRP/src/Documents/Storno/Storno.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
 <name>Storno</name>
 <registerRecords>AccumulationRegister.R1002T_PurchaseReturns</registerRecords>
 <registerRecords>InformationRegister.T2015S_TransactionsInfo</registerRecords>
 <registerRecords>InformationRegister.T6060S_BatchCostAllocationInfo</registerRecords>
 <registerRecords>InformationRegister.T6020S_BatchKeysInfo</registerRecords>
 <registerRecords>AccumulationRegister.R5022T_Expenses</registerRecords>
 <registerRecords>AccumulationRegister.R6060T_CostOfGoodsSold</registerRecords>
 <registerRecords>AccumulationRegister.TM1030B_TransactionsKey</registerRecords>
 <registerRecords>InformationRegister.T2013S_OffsetOfAging</registerRecords>
 <registerRecords>AccumulationRegister.R7040T_ManualMaterialsCorretionInProduction</registerRecords>
 <registerRecords>AccumulationRegister.R9555T_PaidSickLeaves</registerRecords>
 <registerRecords>AccumulationRegister.R2005T_SalesSpecialOffers</registerRecords>
 <registerRecords>InformationRegister.T6040S_BundleAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R1021B_VendorsTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R2022B_CustomersPaymentPlanning</registerRecords>
 <registerRecords>AccumulationRegister.R6025B_SimpleBatch</registerRecords>
 <registerRecords>AccumulationRegister.TM1010B_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R2010T_SalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R3011T_CashFlow</registerRecords>
 <registerRecords>InformationRegister.PricesByItems</registerRecords>
 <registerRecords>AccumulationRegister.R9610T_ShipmentPlaning</registerRecords>
 <registerRecords>AccumulationRegister.R4037B_PlannedReceiptReservationRequests</registerRecords>
 <registerRecords>InformationRegister.T9510S_Staffing</registerRecords>
 <registerRecords>AccumulationRegister.R2014T_CanceledSalesOrders</registerRecords>
 <registerRecords>AccumulationRegister.R3027B_EmployeeCashAdvance</registerRecords>
 <registerRecords>AccumulationRegister.R6510B_StockBalance</registerRecords>
 <registerRecords>InformationRegister.T2010S_OffsetOfAdvances</registerRecords>
 <registerRecords>AccumulationRegister.R1001T_Purchases</registerRecords>
 <registerRecords>AccumulationRegister.R1005T_PurchaseSpecialOffers</registerRecords>
 <registerRecords>InformationRegister.T7010S_BillOfMaterials</registerRecords>
 <registerRecords>AccumulationRegister.R9541T_VacationUsage</registerRecords>
 <registerRecords>InformationRegister.T7051S_ProductionDurationDetails</registerRecords>
 <registerRecords>AccumulationRegister.R5010B_ReconciliationStatement</registerRecords>
 <registerRecords>AccumulationRegister.R8510B_BookValueOfFixedAsset</registerRecords>
 <registerRecords>AccumulationRegister.R3025B_PurchaseOrdersToBePaid</registerRecords>
 <registerRecords>InformationRegister.S1001L_VendorsPricesByItemKey</registerRecords>
 <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
 <registerRecords>InformationRegister.T3010S_RowIDInfo</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_RowIDSerialLotNumbers</registerRecords>
 <registerRecords>AccumulationRegister.R4017B_InternalSupplyRequestProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R3022B_CashInTransitOutgoing</registerRecords>
 <registerRecords>AccumulationRegister.B1040B_AgingKey</registerRecords>
 <registerRecords>AccumulationRegister.T1050T_AccountingQuantities</registerRecords>
 <registerRecords>InformationRegister.BundleContents</registerRecords>
 <registerRecords>AccumulationRegister.R4020T_StockTransferOrders</registerRecords>
 <registerRecords>AccumulationRegister.R4015T_InternalSupplyRequests</registerRecords>
 <registerRecords>AccumulationRegister.R6010B_BatchWiseBalance</registerRecords>
 <registerRecords>InformationRegister.T8515S_FixedAssetsLocation</registerRecords>
 <registerRecords>InformationRegister.T6080S_ReallocatedBatchesAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R4022B_StockTransferOrdersShipment</registerRecords>
 <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
 <registerRecords>InformationRegister.PricesByItemKeys</registerRecords>
 <registerRecords>AccumulationRegister.R2002T_SalesReturns</registerRecords>
 <registerRecords>AccumulationRegister.R3021B_CashInTransitIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R1020B_AdvancesToVendors</registerRecords>
 <registerRecords>AccumulationRegister.TM1020B_AdvancesKey</registerRecords>
 <registerRecords>AccumulationRegister.R4050B_StockInventory</registerRecords>
 <registerRecords>AccumulationRegister.R2050T_RetailSales</registerRecords>
 <registerRecords>AccumulationRegister.R9010B_SourceOfOriginStock</registerRecords>
 <registerRecords>InformationRegister.T2014S_AdvancesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R8515T_CostOfFixedAsset</registerRecords>
 <registerRecords>AccumulationRegister.R3026B_SalesOrdersCustomerAdvance</registerRecords>
 <registerRecords>InformationRegister.T6050S_ManualBundleAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R3050T_PosCashBalances</registerRecords>
 <registerRecords>AccumulationRegister.R2001T_Sales</registerRecords>
 <registerRecords>AccumulationRegister.R3035T_CashPlanning</registerRecords>
 <registerRecords>AccumulationRegister.R9545T_PaidVacations</registerRecords>
 <registerRecords>AccumulationRegister.R7030T_ProductionPlanning</registerRecords>
 <registerRecords>InformationRegister.T6070S_BatchRevenueAllocationInfo</registerRecords>
 <registerRecords>AccumulationRegister.R2021B_CustomersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
 <registerRecords>AccumulationRegister.R8015T_ConsignorPrices</registerRecords>
 <registerRecords>InformationRegister.T9540S_EmployeeVacations</registerRecords>
 <registerRecords>AccumulationRegister.R4032B_GoodsInTransitOutgoing</registerRecords>
 <registerRecords>AccumulationRegister.DELETE_R3040B_WithholdingTax</registerRecords>
 <registerRecords>AccumulationRegister.R1031B_ReceiptInvoicing</registerRecords>
 <registerRecords>AccumulationRegister.R1040B_TaxesOutgoing</registerRecords>
 <registerRecords>AccumulationRegister.R9570T_AdditionalDeduction</registerRecords>
 <registerRecords>InformationRegister.PostedDocumentsRegistry</registerRecords>
 <registerRecords>AccumulationRegister.R1012B_PurchaseOrdersInvoiceClosing</registerRecords>
 <registerRecords>AccumulationRegister.R7020T_MaterialPlanning</registerRecords>
 <registerRecords>InformationRegister.PricesByProperties</registerRecords>
 <registerRecords>AccumulationRegister.R4052T_StockAdjustmentAsSurplus</registerRecords>
 <registerRecords>AccumulationRegister.R4035B_IncomingStocks</registerRecords>
 <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
 <registerRecords>InformationRegister.T6010S_BatchesInfo</registerRecords>
 <registerRecords>AccumulationRegister.R4031B_GoodsInTransitIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R5020B_PartnersBalance</registerRecords>
 <registerRecords>InformationRegister.T9520S_TimeSheetInfo</registerRecords>
 <registerRecords>AccumulationRegister.R8014T_ConsignorSales</registerRecords>
 <registerRecords>AccumulationRegister.R3010B_CashOnHand</registerRecords>
 <registerRecords>AccumulationRegister.R4051T_StockAdjustmentAsWriteOff</registerRecords>
 <registerRecords>AccumulationRegister.R6070T_OtherPeriodsExpenses</registerRecords>
 <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
 <registerRecords>AccumulationRegister.R5011B_CustomersAging</registerRecords>
 <registerRecords>AccumulationRegister.R2020B_AdvancesFromCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R7010T_DetailingSupplies</registerRecords>
 <registerRecords>AccumulationRegister.R9510B_SalaryPayment</registerRecords>
 <registerRecords>AccumulationRegister.R5021T_Revenues</registerRecords>
 <registerRecords>AccumulationRegister.CashInTransit</registerRecords>
 <registerRecords>AccumulationRegister.R2040B_TaxesIncoming</registerRecords>
 <registerRecords>InformationRegister.T8510S_FixedAssetsInfo</registerRecords>
 <registerRecords>AccumulationRegister.TM1010T_RowIDMovements</registerRecords>
 <registerRecords>AccumulationRegister.R7050T_ProductionDurations</registerRecords>
 <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
 <registerRecords>InformationRegister.T4050_StockInventoryInfo</registerRecords>
 <registerRecords>AccumulationRegister.R2006T_Certificates</registerRecords>
 <registerRecords>AccumulationRegister.R5012B_VendorsAging</registerRecords>
 <registerRecords>AccumulationRegister.R1014T_CanceledPurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R3015B_CashAdvance</registerRecords>
 <registerRecords>InformationRegister.T6090S_CompositeBatchesAmountValues</registerRecords>
 <registerRecords>AccumulationRegister.R6020B_BatchBalance</registerRecords>
 <registerRecords>AccumulationRegister.R4016B_InternalSupplyRequestOrdering</registerRecords>
 <registerRecords>AccumulationRegister.R6050T_SalesBatches</registerRecords>
 <registerRecords>AccumulationRegister.R1010T_PurchaseOrders</registerRecords>
 <registerRecords>AccumulationRegister.R1022B_VendorsPaymentPlanning</registerRecords>
 <registerRecords>AccumulationRegister.R6080T_OtherPeriodsRevenues</registerRecords>
 <registerRecords>AccumulationRegister.R4033B_GoodsReceiptSchedule</registerRecords>
 <registerRecords>AccumulationRegister.T1040T_AccountingAmounts</registerRecords>
 <registerRecords>AccumulationRegister.R2023B_AdvancesFromRetailCustomers</registerRecords>
 <registerRecords>AccumulationRegister.R3024B_SalesOrdersToBePaid</registerRecords>
 <registerRecords>AccumulationRegister.R4036B_IncomingStocksRequested</registerRecords>
 <registerRecords>AccumulationRegister.R6030T_BatchShortageOutgoing</registerRecords>
 <registerRecords>AccumulationRegister.R9560T_AdditionalAccrual</registerRecords>
 <registerRecords>AccumulationRegister.R4014B_SerialLotNumber</registerRecords>
 <registerRecords>AccumulationRegister.R4021B_StockTransferOrdersReceipt</registerRecords>
 <registerRecords>AccumulationRegister.R2031B_ShipmentInvoicing</registerRecords>
 <registerRecords>AccumulationRegister.R6040T_BatchShortageIncoming</registerRecords>
 <registerRecords>AccumulationRegister.R3016B_ChequeAndBonds</registerRecords>
 <registerRecords>AccumulationRegister.R2012B_SalesOrdersInvoiceClosing</registerRecords>
 <registerRecords>InformationRegister.T9550S_EmployeeSickLeave</registerRecords>
 <registerRecords>InformationRegister.ChequeBondStatuses</registerRecords>
 <registerRecords>AccumulationRegister.R5015B_OtherPartnersTransactions</registerRecords>
 <registerRecords>AccumulationRegister.R1011B_PurchaseOrdersReceipt</registerRecords>
 <registerRecords>InformationRegister.T6095S_WriteOffBatchesInfo</registerRecords>
 <attributes>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </attributes>
 <attributes>
  <name>Basis</name>
  <type>
   <types>DefinedType.typeDocumentsWithStorno</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Document>

IRP/src/AccumulationRegisters/R6010B_BatchWiseBalance/R6010B_BatchWiseBalance.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>R6010B_BatchWiseBalance</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>InvoiceTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>IndirectCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>IndirectCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraCostAmountByRatio</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraCostTaxAmountByRatio</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraDirectCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>ExtraDirectCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedCostAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedCostTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedRevenueAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>AllocatedRevenueTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>TotalAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>TotalNetAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>TotalTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryQuantity</name>
    <type>
      <types>DefinedType.typeQuantity</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <resources>
    <name>PreliminaryTaxAmount</name>
    <type>
      <types>DefinedType.typeAmount</types>
    </type>
  </resources>
  <attributes>
    <name>Document</name>
    <type>
      <types>DocumentRef.SalesReportFromTradeAgent</types>
      <types>DocumentRef.PurchaseInvoice</types>
      <types>DocumentRef.PurchaseReturn</types>
      <types>DocumentRef.CommissioningOfFixedAsset</types>
      <types>DocumentRef.Unbundling</types>
      <types>DocumentRef.OpeningEntry</types>
      <types>DocumentRef.RetailReturnReceipt</types>
      <types>DocumentRef.SalesReturn</types>
      <types>DocumentRef.StockAdjustmentAsSurplus</types>
      <types>DocumentRef.ModernizationOfFixedAsset</types>
      <types>DocumentRef.StockAdjustmentAsWriteOff</types>
      <types>DocumentRef.Bundling</types>
      <types>DocumentRef.RetailSalesReceipt</types>
      <types>DocumentRef.WorkSheet</types>
      <types>DocumentRef.SalesReportToConsignor</types>
      <types>DocumentRef.Production</types>
      <types>DocumentRef.ItemStockAdjustment</types>
      <types>DocumentRef.DecommissioningOfFixedAsset</types>
      <types>DocumentRef.InventoryTransfer</types>
      <types>DocumentRef.BatchReallocateIncoming</types>
      <types>DocumentRef.BatchReallocateOutgoing</types>
      <types>DocumentRef.SalesInvoice</types>
      <types>DocumentRef.GoodsReceipt</types>
    </type>
  </attributes>
  <attributes>
    <name>IsSalesConsignorStocks</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>CatalogRef.Batches</types>
    </type>
  </dimensions>
  <dimensions>
    <name>BatchKey</name>
    <type>
      <types>CatalogRef.BatchKeys</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

IRP/src/Documents/Storno/ManagerModule.bsl
#Region PrintForm

Function GetPrintForm(Ref, PrintFormName, AddInfo = Undefined) Export
	Return Undefined;
EndFunction

#EndRegion

#Region Posting

Function PostingGetDocumentDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = New Structure;
	QueryArray = GetQueryTextsSecondaryTables();
	Parameters.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
		
	AccoumulationRegisterData = New Structure();
	
	ArrayOfRegisterMetadata = New Array();
	For Each RegisterMetadata In Ref.Basis.Metadata().RegisterRecords Do
		ArrayOfRegisterMetadata.Add(RegisterMetadata);
	EndDo;                       
	
	ArrayOfRegisterMetadata.Add(Metadata.AccumulationRegisters.R6010B_BatchWiseBalance);
	
	For Each RegisterMetadata In ArrayOfRegisterMetadata Do  
		
		If Metadata.AccumulationRegisters.Find(RegisterMetadata.Name) <> Undefined Then 
			
			RecordSet = AccumulationRegisters[RegisterMetadata.Name].CreateRecordSet();
			
			If RegisterMetadata = Metadata.AccumulationRegisters.R6010B_BatchWiseBalance Then
				Query = New Query();
				Query.Text = 
				"SELECT *, undefined as Document
				|FROM
				|	AccumulationRegister.R6010B_BatchWiseBalance AS R6010B_BatchWiseBalance
				|WHERE
				|	R6010B_BatchWiseBalance.Document = &Document 
				|	and R6010B_BatchWiseBalance.Recorder <> &Ref";
				Query.SetParameter("Document", Ref.Basis);
				Query.SetParameter("Ref", Ref);
				
				QueryResult = Query.Execute();
				QueryTable = QueryResult.Unload();
				
				RecordSet.Filter.Recorder.Set(Ref);
				RecordSet.Read();
				RecordSet.Clear();
				RecordSet.Load(QueryTable);		
			Else
				RecordSet = AccumulationRegisters[RegisterMetadata.Name].CreateRecordSet();
				RecordSet.Filter.Recorder.Set(Ref.Basis);
				RecordSet.Read();
		
				If RecordSet.Count() = 0 Then
					Continue;
				EndIf;
			EndIf;
		
			RegisterData = CreateColumnsByRegister(RegisterMetadata);
			AccoumulationRegisterData.Insert(RegisterMetadata.Name, 
				New Structure("Table, QueryText", RegisterData.Table, 
					StrTemplate("select &Period as Period, * into %1 from &%1 as %1 where true", 
						RegisterMetadata.Name)));
			
			For Each Record In RecordSet Do
				NewRecord = RegisterData.Table.Add();
				FillPropertyValues(NewRecord, Record);
				If RegisterData.IsBalance Then
					NewRecord.RecordType = Record.RecordType;
				EndIf;
				For Each Res In RegisterData.Resources Do
					NewRecord[Res] = - Record[Res];
				EndDo;
			EndDo;
			
		EndIf;
	EndDo;
		
	Query = New Query();
	Query.TempTablesManager = Parameters.TempTablesManager;
	ArrayOfQueryText = New Array();
	For Each RegisterData In AccoumulationRegisterData Do
		 ArrayOfQueryText.Add(RegisterData.Value.QueryText);
		 Query.SetParameter(RegisterData.Key, RegisterData.Value.Table);
	EndDo;
	Query.SetParameter("Period", Ref.Date);
	Query.Text = StrConcat(ArrayOfQueryText, " ; "); 
	Query.Execute();
	
	RowIDTables = New Structure();
	
	_TM1010B_RowIDMovements = Query.TempTablesManager.Tables.Find("TM1010B_RowIDMovements");
	If _TM1010B_RowIDMovements <> Undefined Then
		RowIDTables.Insert("TM1010B_RowIDMovements", _TM1010B_RowIDMovements.GetData().Unload());	
	EndIf;
		
	_TM1010T_RowIDMovements = Query.TempTablesManager.Tables.Find("TM1010T_RowIDMovements");
	If _TM1010T_RowIDMovements <> Undefined Then
		RowIDTables.Insert("TM1010T_RowIDMovements", _TM1010T_RowIDMovements.GetData().Unload());
	EndIf;
		
	_T1040T_RowIDSerialLotNumbers = Query.TempTablesManager.Tables.Find("T1040T_RowIDSerialLotNumbers");
	If _T1040T_RowIDSerialLotNumbers <> Undefined Then
		RowIDTables.Insert("T1040T_RowIDSerialLotNumbers", _T1040T_RowIDSerialLotNumbers.GetData().Unload());
	EndIf;
	
	CommonFunctionsClientServer.PutToAddInfo(AddInfo, "RowIDTables", RowIDTables);
		
	Return Tables;
EndFunction

Function CreateColumnsByRegister(RegisterMetadata)
	Result = New Structure();
	Result.Insert("Table", New ValueTable());
	Result.Insert("Dimensions", New Array());
	Result.Insert("Resources", New Array());
	Result.Insert("Attributes", New Array());
	Result.Insert("IsBalance", False);
	 
	For Each Dim In RegisterMetadata.Dimensions Do
		Result.Table.Columns.Add(Dim.Name, Dim.Type);
		Result.Dimensions.Add(Dim.Name);
	EndDo;	
			
	For Each Res In RegisterMetadata.Resources Do
		Result.Table.Columns.Add(Res.Name, Res.Type);
		Result.Resources.Add(Res.Name);
	EndDo;
	
	For Each Att In RegisterMetadata.Attributes Do
		If Upper(Att.Name) = Upper("CalculationMovementCost") Then
			Continue;
		EndIf;
		Result.Table.Columns.Add(Att.Name, Att.Type);
		Result.Attributes.Add(Att.Name);
	EndDo;
	
	If RegisterMetadata.RegisterType = Metadata.ObjectProperties.AccumulationRegisterType.Balance  Then
		Result.IsBalance = True;
		Result.Table.Columns.Add("RecordType",  New TypeDescription("AccumulationRecordType"));			
	EndIf;
	Return Result;
EndFunction
			
Function PostingGetLockDataSource(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure PostingCheckBeforeWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	Tables = Parameters.DocumentDataTables;
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.SetRegisters(Tables, Ref);
	PostingServer.FillPostingTables(Tables, Ref, QueryArray, Parameters);
EndProcedure

Function PostingGetPostingDataTables(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	PostingDataTables = New Map;
	PostingServer.SetPostingDataTables(PostingDataTables, Parameters);
	Return PostingDataTables;
EndFunction

Procedure PostingCheckAfterWrite(Ref, Cancel, PostingMode, Parameters, AddInfo = Undefined) Export
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region Undoposting

Function UndopostingGetDocumentDataTables(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Return PostingGetDocumentDataTables(Ref, Cancel, Undefined, Parameters, AddInfo);
EndFunction

Function UndopostingGetLockDataSource(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	DataMapWithLockFields = New Map;
	Return DataMapWithLockFields;
EndFunction

Procedure UndopostingCheckBeforeWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	QueryArray = GetQueryTextsMasterTables();
	PostingServer.ExecuteQuery(Ref, QueryArray, Parameters);
EndProcedure

Procedure UndopostingCheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	Parameters.Insert("Unposting", True);
	CheckAfterWrite(Ref, Cancel, Parameters, AddInfo);
EndProcedure

#EndRegion

#Region CheckAfterWrite

Procedure CheckAfterWrite(Ref, Cancel, Parameters, AddInfo = Undefined) Export
	If CommonFunctionsClientServer.GetFromAddInfo(AddInfo, "UnitTest", False) Then
		Return;
	EndIf;
EndProcedure

#EndRegion

#Region Posting_Info

Function GetInformationAboutMovements(Ref) Export
	Str = New Structure;
	Str.Insert("QueryParameters", GetAdditionalQueryParameters(Ref));
	Str.Insert("QueryTextsMasterTables", GetQueryTextsMasterTables());
	Str.Insert("QueryTextsSecondaryTables", GetQueryTextsSecondaryTables());
	Return Str;
EndFunction

Function GetAdditionalQueryParameters(Ref)
	StrParams = New Structure;
	StrParams.Insert("Ref", Ref);
	StrParams.Insert("Period", Ref.Date);
	Return StrParams;
EndFunction

Function GetQueryTextsSecondaryTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

Function GetQueryTextsMasterTables()
	QueryArray = New Array;
	Return QueryArray;
EndFunction

#EndRegion

#Region AccessObject

Function GetAccessKey(Obj) Export
	AccessKeyMap = New Map;
	AccessKeyMap.Insert("Company", Obj.Company);
	Return AccessKeyMap;
EndFunction

#EndRegion
